Autodesk.Navisworks.Api.ModelCreatorNames
Names (values of Autodesk.Navisworks.Api.Model.Creator) of commonly found model creators.

Autodesk.Navisworks.Api.ModelCreatorNames.ArchicadExporter
Models created by export from Archicad

Autodesk.Navisworks.Api.ModelCreatorNames.AsciiLaserReader
Models created by ASCII Laser reader

Autodesk.Navisworks.Api.ModelCreatorNames.AutodeskRealDwgReader
Models created by Autodesk RealDWG reader

Autodesk.Navisworks.Api.ModelCreatorNames.Cis2Reader
Models created by CIS/2 reader

Autodesk.Navisworks.Api.ModelCreatorNames.DwfReader
Models created by DWF reader

Autodesk.Navisworks.Api.ModelCreatorNames.FaroReader
Models created by Faro reader

Autodesk.Navisworks.Api.ModelCreatorNames.IfcReader
Models created by IFC reader

Autodesk.Navisworks.Api.ModelCreatorNames.IgesReader
Models created by IGES reader

Autodesk.Navisworks.Api.ModelCreatorNames.InventorReader
Models created by Inventor reader

Autodesk.Navisworks.Api.ModelCreatorNames.JTOpenReader
Models created by JTOpen reader

Autodesk.Navisworks.Api.ModelCreatorNames.LeicaReader
Models created by Leica reader

Autodesk.Navisworks.Api.ModelCreatorNames.MaxExporter
Models created by export from 3D Studio Max

Autodesk.Navisworks.Api.ModelCreatorNames.MicrostationExporter
Models created by export from Microstation

Autodesk.Navisworks.Api.ModelCreatorNames.MicrostationReader
Models created by Microstation design file (DGN) reader

Autodesk.Navisworks.Api.ModelCreatorNames.ParasolidReader
Models created by Parasolid reader

Autodesk.Navisworks.Api.ModelCreatorNames.RevitExporter
Models created by export from Revit

Autodesk.Navisworks.Api.ModelCreatorNames.RieglReader
Models created by Riegl reader

Autodesk.Navisworks.Api.ModelCreatorNames.RvmReader
Models created by RVM reader

Autodesk.Navisworks.Api.ModelCreatorNames.SatReader
Models created by SAT reader

Autodesk.Navisworks.Api.ModelCreatorNames.SketchUpReader
Models created by SketchUp reader

Autodesk.Navisworks.Api.ModelCreatorNames.StepReader
Models created by STEP reader

Autodesk.Navisworks.Api.ModelCreatorNames.StlReader
Models created by STL reader

Autodesk.Navisworks.Api.ModelCreatorNames.The3DStudioReader
Models created by 3D Studio reader

Autodesk.Navisworks.Api.ModelCreatorNames.VrmlReader
Models created by VRML reader

Autodesk.Navisworks.Api.ModelCreatorNames.ZAndFReader
Models created by Z+F reader